backend/controllers/AgencyController.php

SELECT * FROM `g_agency` WHERE `id`='31'
---
    public function actionPay()
    {
        $this->layout = false;
        if(empty(\Yii::$app->request->get('id'))){
            $id =  \Yii::$app->request->post('id');
        }else{
            $id =  \Yii::$app->request->get('id');
        }

        $model = Agency::findOne($id);

SELECT * FROM `g_agency` WHERE `id`='30'
---
    public function actionDeduct()
    {
        $this->layout = false;
        if(empty(\Yii::$app->request->get('id'))){
            $id =  \Yii::$app->request->post('id');
        } else{
            $id =  \Yii::$app->request->get('id');
        }

        $model = Agency::findOne($id);