backend/controllers/CurrencyPayController.php

    public function actionIndex()
    {
        CurrencyPay::GetCurrency();
        /*if (\Yii::$app->request->get('show') == 1) {
            $data = CurrencyPay::find()->where(['type' => 1])->orderBy('money ASC')->asArray()->all();
        } else if (\Yii::$app->request->get('show') == 2) {
            $data = CurrencyPay::find()->where(['type' => 2])->orderBy('money ASC')->asArray()->all();
        } else {*/
            $data = CurrencyPay::find()->orderBy('money ASC')->asArray()->all();
---
SELECT * FROM `g_currency_pay` ORDER BY `money`