backend/controllers/DayTaskController.php

    public function actionWaste(){
        $data = DayTask::find()->where(['type_id'=>7])->asArray()->all();
---
SELECT * FROM `g_day_task` WHERE `type_id`=7

    public function actionDeepSea(){
        $data = DayTask::find()->where(['type_id'=>9])->asArray()->all();
---
SELECT * FROM `g_day_task` WHERE `type_id`=9

    public function actionGameIndex(){
        $data = DayTask::find()->where(['type_id'=>10])->asArray()->all();
---
SELECT * FROM `g_day_task` WHERE `type_id`=10

    public function actionPrizeExpert(){
        $this->layout = false;
        $id = empty(\Yii::$app->request->get('id')) ? \Yii::$app->request->post('id') : \Yii::$app->request->get('id');
        $model = DayTask::findOne($id);
---
SELECT * FROM `g_day_task` WHERE `id`='13'