backend/controllers/DiamondsController.php

    public function actionIndex()
    {
        $model = Diamonds::find();
        $pages = new Pagination(
            [
                'totalCount' =>$model->count(),
                'pageSize' =>\Yii::$app->params['pageSize']
            ]
        );
        $data  = $model->limit($pages->limit)->offset($pages->offset)->orderBy('need_diamond ASC')->asArray()->all();
---
SELECT COUNT(*) FROM `g_diamonds`
SELECT * FROM `g_diamonds` ORDER BY `need_diamond` LIMIT 15

    public function actionPrize(){
        $this->layout = false;
        // RedeemCode::setShop();
        $id = empty(\Yii::$app->request->get('id')) ? \Yii::$app->request->post('id') : \Yii::$app->request->get('id');
        $model = Diamonds::findOne($id);
---
SELECT * FROM `g_diamonds` WHERE `id`='12'