backend/controllers/GameController.php

    public function actionIndex(){
        $data = Game::find()->all();
---
SELECT * FROM `g_game`