backend/controllers/GoodsController.php

SELECT COUNT(*) FROM `g_goods` WHERE (`created_at` >= 1483200000) AND (`created_at` <= 1499932201)
SELECT * FROM `g_goods` WHERE (`created_at` >= 1483200000) AND (`created_at` <= 1499932201) LIMIT 10
---
    public function actionIndex()
    {
        $goods = new Goods();
        $goods->load(\Yii::$app->request->get());
        $goods->initTime();
        $model      = '';
        if($goods->keyword != ''){
            //$agencyInfo = Goods::find()->where($goods->searchWhere())->all();
            $model = Goods::find()->andWhere($goods->searchWhere());

        }else {

            $model = Goods::find();

        }
        $model->andWhere(['>=','created_at',strtotime($goods->starttime)])->andWhere(['<=','created_at',strtotime($goods->endtime)]);
        $pages      = new Pagination(['totalCount' =>$model->count(), 'pageSize' => \Yii::$app->params['pageSize']]);
        $data       = $model->limit($pages->limit)->offset($pages->offset)->asArray()->all();

SELECT * FROM `g_goods` WHERE `id`='6'
SELECT * FROM `g_users` WHERE `game_id`=6543211
UPDATE `g_goods` SET `status`=2, `updated_at`=1497532353 WHERE `id`='6'
---
    public function actionYes(){
        \Yii::$app->response->format = Response::FORMAT_JSON;
        $model = Goods::findOne(['id'=>\Yii::$app->request->get('id')]);
        if ($model->status==3 || $model->status==2){
            return ['code'=>0,'message'=>'数据已经处理过了!'];
        }
        $game_id = $model->game_id;
        $data = Users::findOne(['game_id'=>$game_id]);
        if ($data===null || $data===false){
            return ['code'=>0,'message'=>'没有该用户!'];
        }
        $uids = $data->id;
        $rows = UsersGoldObject::findOne(['users_id'=>$uids,'gold_config'=>'金币']);
        if ($rows->gold<$model->gold){
           return ['code'=>0,'message'=>'金币不足!'];
        }
        $gold=$model->gold;
        $rows->gold=$rows->gold-$gold;
        $rows->save(false);
        $model->status=2;
        $model->updated_at=time();
        if ($model->save(false)){