backend/controllers/RedeemCodeController.php

SELECT * FROM `g_redeem_code` WHERE `id`='6'
---
    public function actionPrize(){
        $this->layout = false;
       // RedeemCode::setShop();
        $id = empty(\Yii::$app->request->get('id')) ? \Yii::$app->request->post('id') : \Yii::$app->request->get('id');
        $model = RedeemCode::findOne($id);

SELECT `redeem_code`, `name` FROM `g_redeem_code` WHERE `status` IN (0, 2)
---
    public function actionExport(){
        //theCsv::export('g_redeem_code');

        /*theCsv::export([
            'table' => 'g_redeem_code',
            'fields' => ['redeem_code','name'],
            'header' => ['兑换码','名称'],
        ]);*/
        $data = RedeemCode::find()->select(['redeem_code','name'])->where(['in','status',[0,2]])->asArray()->all();

SELECT * FROM `g_redeem_code` WHERE `id`='31'
---
    public function actionEdit()
    {
        $this->layout = false;
        //RedeemCode::setShop();
        $id = empty(\Yii::$app->request->get('id')) ? \Yii::$app->request->post('id') : \Yii::$app->request->get('id');
        $model = RedeemCode::findOne($id);