backend/controllers/ShopController.php

    public function actionIndex()
    {

        $data = Shop::find()->orderBy('jewel_number ASC')->asArray()->all();
---
SELECT * FROM `g_shop` ORDER BY `jewel_number`