frontend/controllers/LogController.php

SELECT COUNT(*) FROM `g_agency_pay` WHERE `agency_id`='31'
SELECT * FROM `g_agency_pay` WHERE `agency_id`='31' LIMIT 21
---
    public function actionPay()
    {
        $startTime = \Yii::$app->request->get('startTime');
        $endTime   = \Yii::$app->request->get('endTime');
        $model = AgencyPay::find()->andWhere(['agency_id'=>\Yii::$app->session->get('agencyId')]);
        if($startTime)
            $model = $model->andWhere(['>=','time',strtotime($startTime)]);
        else
            $startTime = date('Y-m-d H:i:s',strtotime('-1 month'));

        if ($endTime)
            $model = $model->andWhere(['<=','time',strtotime($endTime)]);
        else
            $endTime = date('Y-m-d H:i:s',time());
        $pages = new Pagination(['totalCount' =>$model->count(), 'pageSize' => \Yii::$app->params['pageSize']]);
        $data = $model->offset($pages->offset)->limit($pages->limit)->all();

SELECT * FROM `g_user_pay` WHERE `agency_id`='31' LIMIT 21
SELECT COUNT(*) FROM `g_user_pay` WHERE `agency_id`='31'
SELECT * FROM `g_user_pay` WHERE `agency_id`='31' LIMIT 10
---
    public function actionUserPay()
    {
        $game_id =  \Yii::$app->request->get('game_id');
        $startTime = \Yii::$app->request->get('startTime');
        $endTime   = \Yii::$app->request->get('endTime');
        $model = UserPay::find()->andWhere(['agency_id'=>\Yii::$app->session->get('agencyId')]);
        if($startTime)
            $model = $model->andWhere(['>=','time',strtotime($startTime)]);
        else
            $startTime = date('Y-m-d H:i:s',strtotime('-1 month'));
        if ($endTime)
            $model = $model->andWhere(['<=','time',strtotime($endTime)]);
        else
            $endTime = date('Y-m-d H:i:s',time());
        if ($game_id){
            if (is_numeric($game_id)){
                $model->andWhere(['game_id'=>$game_id]);
            }else{
                $model->andWhere(['nickname'=>$game_id]);
            }

        }
        $pages = new Pagination(['totalCount' =>$model->count(), 'pageSize' => \Yii::$app->params['pageSize']]);
        $data = $model->offset($pages->offset)->limit($pages->limit)->all();