frontend/controllers/PayController.php

SELECT * FROM `g_users` WHERE `game_id`='28'
---
    public function actionPay()
    {
        if(\Yii::$app->request->get('game_id'))
        {
            $data = Users::find()->where(['game_id'=>\Yii::$app->request->get('game_id')])->one();

SELECT * FROM `g_users` WHERE `id`='88'
---
    public function actionPay1()
    {
        $this->layout = false;
        $id = empty(\Yii::$app->request->get('id')) ? \Yii::$app->request->post('id') : \Yii::$app->request->get('id');
        $model = Users::findOne($id);