frontend/controllers/SiteController.php

SELECT * FROM `g_agency` WHERE `id` IS NULL
SELECT * FROM `g_agency_pay` WHERE (`agency_id` IS NULL) AND (`time` > 1498838400) AND (`time` < 1501516799) ORDER BY `time`
---
    public function actionIndex()
    {

        #获取用户基本资料
        $model = Agency::findOne(\Yii::$app->session->get('agencyId'));

        $year       = date('Y');
        $month      = date('m');
        $dayNum     = cal_days_in_month(CAL_GREGORIAN,$month,$year);//算当前月份的天数
        $startTime  = strtotime(($year."-".$month));//算出开始查询的时间戳
        $endTime    = strtotime(($year."-".$month."-".$dayNum." 23:59:59"));//算出结束查询的时间戳
        $orderMonth = [];//平台给代理的充值总金额
        $userOrder  = [];//平台给用户的充值总金额

        /**
         * 算出平台给代理充值的金额
         * 算法思路:
         *      1.查询这个月的所有销售记录
         *      2.循环并累加一个天
         *      3.进入二次循环并判断时间是否为当天、
         *          为当天并unset当前key、此操作为提高程序性能
         */
        $data = AgencyPay::find()->andWhere(['agency_id'=>\Yii::$app->session->get('agencyId')])
            ->andWhere([">",'time',$startTime])
            ->andWhere(["<","time",$endTime])
            ->orderBy("time ASC")->asArray()->all();

SELECT * FROM `g_user_pay` WHERE (`agency_id` IS NULL) AND (`time` > 1498838400) AND (`time` < 1501516799) ORDER BY `time`
---
         * 算出平台给用户充值的数量
         * 算法思路 同上
         */
        $data = UserPay::find()->andWhere(['agency_id'=>\Yii::$app->session->get('agencyId')])
            ->andWhere([">",'time',$startTime])
            ->andWhere(["<","time",$endTime])
            ->orderBy("time ASC")->asArray()->all();