frontend/controllers/WithdrawController.php

SELECT * FROM `g_person` WHERE `game_id`='31'
---
    public function actionAdd(){
        $this->layout = false;
        $model = new Withdraw();
        if(\Yii::$app->request->isPost)
        {
            \Yii::$app->response->format = Response::FORMAT_JSON;
            if($model->add(\Yii::$app->request->post())){
                return ['code'=>1,'message'=>'添加成功'];
            }
            $message = $model->getFirstErrors();
            $message = reset($message);
            return ['code'=>0,'message'=>$message];
        }
        $data = Person::findOne(['game_id'=>\Yii::$app->session->get('agencyId')]);

SELECT * FROM `g_person` WHERE `game_id`='31'
---
    public function actionGetPerson(){
        $data = Person::findOne(['game_id'=>\Yii::$app->session->get('agencyId')]);