common/models/AgencyObject.php

SELECT EXISTS(SELECT * FROM `g_agency` WHERE (`id`='31'))
UPDATE `g_agency_gold` SET `gold`='100', `sum_gold`='100' WHERE `id`='12'
---
    public function payGold($payGoldConfig,$payGold)
    {

        if(empty(self::$goldConfig)){
            self::$goldConfig = GoldConfigObject::find()->asArray()->all();
        }

        /**
         * 循环处理代码、避免数据库压力
         */
        foreach (self::$goldConfig as $key=>$value)
        {
            if($value['name'] == $payGoldConfig)
            {
                $data = AgencyGoldObject::find()
                        ->andWhere(['agency_id'=>$this->id])
                        ->andWhere(['gold_config'=>$payGoldConfig])
                        ->one();
                $data->gold       = ($data->gold + $payGold);
                $data->sum_gold   = ($data->sum_gold + $payGold);

                return $data->save();

UPDATE `g_agency_gold` SET `gold`='598', `sum_gold`='598' WHERE `id`='12'
---
    public function consumeGold($payGoldConfig,$payGold)
    {

        if(empty(self::$goldConfig)){
            self::$goldConfig = GoldConfigObject::find()->asArray()->all();
        }

        /**
         * 循环处理代码、避免数据库压力
         */
        foreach (self::$goldConfig as $key=>$value)
        {
            if($value['name'] == $payGoldConfig)
            {
                $data = AgencyGoldObject::find()
                        ->andWhere(['agency_id'=>$this->id])
                        ->andWhere(['gold_config'=>$payGoldConfig])
                        ->one();

                $data->gold       = ($data->gold - $payGold);
                $data->sum_gold   = ($data->sum_gold - $payGold);

                return $data->save(false);