common/models/Diamonds.php

    public function __construct(array $config = [])
    {
        //查询 道具列表中的数据
        $data  = Shop::find()->asArray()->all();
---
SELECT * FROM `g_shop`