common/models/RedeemCode.php

    public function getList($data = [])
    {
        $this->load($data);
        $this->initTime();
        $model   = self::find()->andWhere($this->searchWhere())
            ->andWhere(['>=','created_at',strtotime($this->starttime)])
            ->andWhere(['<=','created_at',strtotime($this->endtime)]);

        if (array_key_exists('show',$data)){
            if (!$data['show']==null){
                $model->andWhere(['add_type'=>$data['show']]);
            }
        }
        $pages = new Pagination(
            [
                'totalCount' =>$model->count(),
                'pageSize' => \Yii::$app->params['pageSize']
            ]
        );
        $data  = $model->limit($pages->limit)->offset($pages->offset)->all();
---
SELECT COUNT(*) FROM `g_redeem_code` WHERE (`created_at` >= 1483200000) AND (`created_at` <= 1501581102) AND (`add_type`='1')
SELECT * FROM `g_redeem_code` WHERE (`created_at` >= 1483200000) AND (`created_at` <= 1501581102) AND (`add_type`='1') LIMIT 15

    public function check($data)
    {
        if ($this->load($data, '')) {
            //验证兑换码的有效性
            $result = RedeemCode::find()->where(['redeem_code'=>"$this->redeem_code"])->one();
            if ($result === null || $result === false || $result->status == 1) {
                $this->addError('message', '验证码无效');
                return false;
            }
            //判断是否在兑换时间内
            $time = time();
            if ($time < strtotime($result->start_time) || $time > strtotime($result->end_time)) {
                $this->addError('message', '兑换不在兑换时间范围内');
                return false;
            }
            //到兑换记录中查询该用户是否兑换过该兑换码
            $re = RedeemRecord::findOne(['redeem_code' => $this->redeem_code, 'game_id' => $this->game_id]);
            if ($re) {
                $this->addError('message', '该兑换码你已兑换');
                return false;
            }
            if ($result->status==0){
                $result->status=1;
                $result->save(false);
            }
            if ($results= Users::findOne(['game_id'=>$this->game_id])){
---
SELECT * FROM `g_redeem_code` WHERE `redeem_code`='1ZJSO0Q4URWZ'
SELECT * FROM `g_redeem_record` WHERE (`redeem_code`='1ZJSO0Q4URWZ') AND (`game_id`='28')
UPDATE `g_redeem_code` SET `status`=1 WHERE `id`='6'
SELECT * FROM `g_users` WHERE `game_id`='28'

    public function __construct(array $config = [])
    {
        //查询 道具列表中的数据
        $data  = Shop::find()->asArray()->all();
        //将道具数组格式化成  对应的数组
        $new_data = ArrayHelper::map($data,'id','name');
        //自定义 赠送类型
        $datas = ['gold'=>'金币','diamond'=>'钻石','fishGold'=>'鱼币'];
        //将数据合并 赋值给数组
        self::$give= ArrayHelper::merge($datas,$new_data);
        parent::__construct($config);
    }

    /*public static function setShop(){
        //查询 道具列表中的数据
        $data  = Shop::find()->asArray()->all();
---
SELECT * FROM `g_shop`