common/models/RedeemCode.php

SELECT * FROM `g_redeem_code` WHERE `redeem_code`='TA1PD2AJKUYM'
SELECT * FROM `g_redeem_record` WHERE (`redeem_code` IS NULL) AND (`game_id`='36')
---
    public function check($data)
    {

        if ($this->load($data, '') && $this->validate()) {
            //验证兑换码的有效性
            $result = RedeemCode::findOne(['redeem_code' =>'TA1PD2AJKUYM']);
            if ($result === null || $result === false || $result->status == 1) {
                $this->addError('message', '验证码无效');
                return false;
            }
            //判断是否在兑换时间内
           /* $time = time();
            if ($time < $result->start_time || $time > $result->end_time) {
                $this->addError('message', '兑换不在兑换时间范围内');
                return false;
            }*/
            //到兑换记录中查询该用户是否兑换过该兑换码
            $re = RedeemRecord::findOne(['redeem_code' => $this->redeem_code, 'game_id' => $this->game_id]);