common/models/RedeemRecord.php

SELECT COUNT(*) FROM `g_redeem_record` WHERE (`created_at` >= 1483200000) AND (`created_at` <= 1501580863)
SELECT * FROM `g_redeem_record` WHERE (`created_at` >= 1483200000) AND (`created_at` <= 1501580863) LIMIT 15
---
    public function getList($data = [])
    {

        $this->load($data);
        $this->initTime();
        //var_dump($this->searchWhere());exit;
        $model   = self::find()->andWhere($this->searchWhere())
            ->andWhere(['>=','created_at',strtotime($this->starttime)])
            ->andWhere(['<=','created_at',strtotime($this->endtime)]);
        $pages = new Pagination(
            [
                'totalCount' =>$model->count(),
                'pageSize' => \Yii::$app->params['pageSize']
            ]
        );
        $data  = $model->limit($pages->limit)->offset($pages->offset)->all();