common/models/RedeemCode.php

SELECT * FROM `g_shop`
---
    public function __construct(array $config = [])
    {
        //查询 道具列表中的数据
        $data  = Shop::find()->asArray()->all();