common/models/UsersObject.php

UPDATE `g_users_gold` SET `gold`='101', `sum_gold`='121' WHERE `id`='4'
---
    public function payGold($payGoldConfig,$payGold)
    {
        if(empty(self::$goldConfig)){
            self::$goldConfig = GoldConfigObject::find()->asArray()->all();
        }

        /**
         * 循环处理代码、避免数据库压力
         */
        foreach (self::$goldConfig as $key=>$value)
        {

            if($value['name'] == $payGoldConfig)
            {
                /*
                 * 1代表数量 2代表时间处理
                 *  */
                if($value['type'] == 1)
                {
                    $data = UsersGoldObject::find()
                            ->andWhere(['users_id'=>$this->id])
                            ->andWhere(['gold_config'=>$payGoldConfig])
                            ->one();
                    $data->gold = ($data->gold + $payGold);
                    $data->sum_gold   = ($data->sum_gold + $payGold);

                    return $data->save();