api/controllers/GameController.php

SELECT * FROM `g_game` WHERE `type`='2'
---
    public function actionRoomrate(){

        $type = \Yii::$app->request->get('type');
        $data = Game::findOne(['type'=>$type]);