api/controllers/TouchController.php

    public function actionIndex(){
        $data = Touch::find()->select('phone,qq_number,hkmovie')->all();
---
SELECT `phone`, `qq_number`, `hkmovie` FROM `g_touch`