backend/models/Agency.php

SELECT * FROM `g_agency` WHERE `id`='31'
INSERT INTO `g_agency_pay` (`agency_id`, `name`, `time`, `gold`, `money`, `notes`, `status`, `manage_id`, `manage_name`, `gold_config`) VALUES ('31', '刘玉', '1497358616', '100', '0', '', 2, 1, 'lrdouble', '房卡')
SELECT * FROM `g_rebate_conf` WHERE `id`=1
---
    public function pay($data)
    {
        $this->scenario = 'pay';
        if($this->load($data) && $this->validate())
        {
            $transaction  = \Yii::$app->db->beginTransaction();
            try{
                $model = self::findOne($this->id);
                $data  = $model->payGold($this->pay_gold_config,$this->pay_gold);

                if(!$data) throw  new \Exception("model保存数据失败");

                $agencyPay = new AgencyPay();
                $agencyPay->agency_id = $model->id;
                $agencyPay->name      = $model->name;
                $agencyPay->time      = time();
                $agencyPay->gold      = $this->pay_gold;
                $agencyPay->money     = $this->pay_money;
                $agencyPay->notes     = '';
                $agencyPay->status    = 2;
                $agencyPay->manage_id = \Yii::$app->session->get('manageId');
                $agencyPay->manage_name = \Yii::$app->session->get('manageName');
                $agencyPay->gold_config = $this->pay_gold_config;
                if($agencyPay->save()== false) throw new \Exception("agencyPay保存数据失败");
                if(\Yii::$app->params['distribution'])
                {
                    $rebateConf = RebateConf::findOne(1);

SELECT EXISTS(SELECT * FROM `g_agency` WHERE (`id`='31'))
---
                    ##由于时间问题、此处算法不佳
                    #一级
                    if ($model->pid != 0) {
                        $one = self::findOne($model->pid);