backend/models/Shop.php

    public static function GetShop(){
        $url = Yii::$app->params['Api'].'/gameserver/control/gettools';
         $data = Request::request_post($url,['time'=>time()]);
         $d=[];
         foreach ($data as $key=>$v){

             if (is_object($v)){
                 $d[]=$v;
             }

         }
         $new = $d[0]->tools;
         foreach ($new as &$e){
             $e->toolName;

         }
         /*foreach ($new as $K=>$value){
             $model = new Shop();
             $model->save($value);
         }*/
       Shop::deleteAll();
       $model =  new Shop();
        foreach($new as $K=>$attributes)
        {
            /*if (Shop::updateAllCounters(
                ['name'=>'防辐射服'],
                ['id'=>$attributes->toolId]

            )){
---
UPDATE `g_shop` SET `name`=`name`+'神灯', `toolDescript`=`toolDescript`+'可以召唤一条彩金鱼，使劲打吧', `jewel_number`=`jewel_number`+1000, `level`=`level`+5 WHERE `id`=1