backend/models/Users.php

    public function pay($data = [])
    {
        $this->scenario = 'pay';
        if($this->load($data) && $this->validate())
        {

            /**
             * 查询用户是否存在
             */
            $model = self::findOne($data['id']);
---
SELECT * FROM `g_users` WHERE `id`='52'

    public function getList($data = [])
    {

        $this->load($data);
        $this->initTime();
        $model   = self::find()->andWhere($this->searchWhere())
                               ->andWhere(['>=','reg_time',strtotime($this->starttime)])
                               ->andWhere(['<=','reg_time',strtotime($this->endtime)])->andWhere(['status'=>[0,1]]);
        $pages = new Pagination(
            [
                'totalCount' =>$model->count(),
                'pageSize' => \Yii::$app->params['pageSize']
            ]
        );

        $data  = $model->limit($pages->limit)->offset($pages->offset)->all();
---
SELECT COUNT(*) FROM `g_users` WHERE (`reg_time` >= 1483200000) AND (`reg_time` <= 1501915878) AND (`status` IN (0, 1))
SELECT * FROM `g_users` WHERE (`reg_time` >= 1483200000) AND (`reg_time` <= 1501915878) AND (`status` IN (0, 1)) LIMIT 15 OFFSET 90

     public function set($data){
        $model  = Users::findOne(['game_id'=>$data]);
---
SELECT * FROM `g_users` WHERE `game_id` IS NULL

    public static function automatic(){
        $data = self::find()->where(['<','unset_time',date('Y-m-d H:i:s')])->andWhere(['status'=>0])->all();
---
SELECT * FROM `g_users` WHERE (`unset_time` < '2017-08-05 14:51:18') AND (`status`=0)

    public static function UpdateUsers(){
        $url = \Yii::$app->params['Api'].'/gameserver/control/getAllPlayers';
        $data = \common\services\Request::request_post($url,['time'=>time()]);
        //请求到数据,循环更新数据
        foreach($data[0] as $K=>$v)
        {
            if ( $model = Users::findOne(['game_id'=>$v->playerid])){
---
SELECT * FROM `g_users` WHERE `game_id`=2