frontend/models/Users.php

    public function pay($data = [])
    {
        $this->scenario = 'pay';
        if($this->load($data) && $this->validate())
        {
            /**
             * 查询用户是否存在
             */
            $model = self::findOne($data['id']);
            if($model)
            {
                $agencyModel = Agency::findOne(\Yii::$app->session->get('agencyId'));
---
SELECT * FROM `g_users` WHERE `id`='52'
SELECT * FROM `g_agency` WHERE `id`='31'