frontend/models/Withdraw.php

SELECT COUNT(*) FROM `g_withdraw` WHERE (`reg_time` >= 1483200000) AND (`reg_time` <= 1502282885) AND (`game_id`='31')
SELECT * FROM `g_withdraw` WHERE (`reg_time` >= 1483200000) AND (`reg_time` <= 1502282885) AND (`game_id`='31') LIMIT 15
---
    public function getList($data = [])
    {
        $this->load($data);
        $this->initTime();
        $model   = self::find()->andWhere($this->searchWhere())
            ->andWhere(['>=','reg_time',strtotime($this->starttime)])
            ->andWhere(['<=','reg_time',strtotime($this->endtime)])->andWhere(['game_id'=>\Yii::$app->session->get('familyId')]);
        $pages = new Pagination(
            [
                'totalCount' =>$model->count(),
                'pageSize' => \Yii::$app->params['pageSize']
            ]
        );

        $data  = $model->limit($pages->limit)->offset($pages->offset)->all();