api/models/Users.php

    public function add($data)
    {
        $this->scenario = 'add';
        if($this->load($data,'') && $this->validate())
        {

            $this->reg_time = time();
            $this->status   = 1;
            $this->gold_all = 0;
            if($this->save())
            {
                $datas = GoldConfigObject::find()->asArray()->all();

                foreach ($datas as $key=>$value)
                {
                    $agencyGold = new UsersGoldObject();
                    $agencyGold->users_id  = $this->id;
                    $agencyGold->gold_config = $value['name'];
                    $agencyGold->gold        = isset($data[$value['en_code']]) ? $data[$value['en_code']] : 0;
                    $agencyGold->sum_gold    = isset($data[$value['en_code']]) ? $data[$value['en_code']] : 0;
                    if($agencyGold->save() == false){
---
INSERT INTO `g_users` (`game_id`, `nickname`, `gold`, `grade`, `vip_grade`, `reg_time`, `status`, `gold_all`) VALUES (102, 'anxiaoye1', '10000', 0, 0, '1501581070', 1, 0)
INSERT INTO `g_users_gold` (`users_id`, `gold_config`, `gold`, `sum_gold`) VALUES (153, '金币', '10000', '10000')